# =============================================================================
# Brewfile — Arthur's Mac Setup
# Usage: brew bundle --file=~/Development/my-config-files/Brewfile
# =============================================================================

# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
tap "homebrew/services"
tap "jondot/tap"                                                          # hygen
tap "mobile-dev-inc/tap"                                                  # maestro
tap "teamookla/speedtest"

# -----------------------------------------------------------------------------
# CLI — Core utilities
# -----------------------------------------------------------------------------
brew "git"
brew "git-flow"
brew "gh"                                                                 # GitHub CLI
brew "tig"                                                                # git TUI
brew "gitui"                                                              # git TUI (Rust)
brew "gitmoji"
brew "diff-so-fancy"                                                      # better git diffs
brew "tree"
brew "wget"
brew "grep"
brew "jq"
brew "shellcheck"
brew "telnet"

# -----------------------------------------------------------------------------
# CLI — Languages & runtimes
# -----------------------------------------------------------------------------
brew "fnm"                                                                # fast Node version manager
brew "node@22"
brew "python@3.13"
brew "python@3.9"
brew "pipx"
brew "uv"                                                                 # fast Python package manager
brew "openjdk@11"
brew "openjdk@17"
brew "php@8.2"
brew "composer"
brew "cocoapods"

# -----------------------------------------------------------------------------
# CLI — Cloud & Kubernetes
# -----------------------------------------------------------------------------
brew "awscli"
brew "kubernetes-cli"
brew "helm@2"
brew "kustomize"
brew "kubeseal"
brew "skaffold"

# -----------------------------------------------------------------------------
# CLI — Media & images
# -----------------------------------------------------------------------------
brew "ffmpeg"
brew "imagemagick"
brew "chafa"                                                              # terminal image viewer
brew "youtube-dl"
brew "qpdf"

# -----------------------------------------------------------------------------
# CLI — Docker & containers
# -----------------------------------------------------------------------------
brew "act"                                                                # run GitHub Actions locally
brew "lazydocker"                                                         # Docker TUI

# -----------------------------------------------------------------------------
# CLI — Code generation & testing
# -----------------------------------------------------------------------------
brew "jondot/tap/hygen"                                                   # code scaffolding
brew "mobile-dev-inc/tap/maestro"                                         # mobile UI testing

# -----------------------------------------------------------------------------
# CLI — Databases
# -----------------------------------------------------------------------------
brew "postgresql@14"

# -----------------------------------------------------------------------------
# CLI — Networking
# -----------------------------------------------------------------------------
brew "teamookla/speedtest/speedtest"

# -----------------------------------------------------------------------------
# CLI — React Native / mobile dependencies
# -----------------------------------------------------------------------------
brew "watchman"

# -----------------------------------------------------------------------------
# Casks — Browsers
# -----------------------------------------------------------------------------
cask "firefox"
cask "google-chrome"
cask "opera-gx"

# -----------------------------------------------------------------------------
# Casks — Development tools
# -----------------------------------------------------------------------------
cask "iterm2"
cask "warp"
cask "docker"
cask "android-studio"
cask "android-platform-tools"
cask "jetbrains-toolbox"
cask "github"                                                             # GitHub Desktop
cask "postman"
cask "insomnia"
cask "dash"                                                               # API documentation browser
cask "electron-fiddle"
cask "pieces"                                                             # code snippet manager
cask "pieces-os"                                                          # Pieces local engine

# -----------------------------------------------------------------------------
# Casks — Databases
# -----------------------------------------------------------------------------
cask "dbngin"
cask "tableplus"
cask "postico"
cask "mongodb-compass"

# -----------------------------------------------------------------------------
# Casks — Productivity
# -----------------------------------------------------------------------------
cask "raycast"
cask "alfred"
cask "notion"
cask "todoist"
cask "slack"
cask "discord"
cask "signal"
cask "whatsapp"
cask "miro"
cask "readdle-spark"                                                      # Spark email client
cask "microsoft-teams@classic"
cask "microsoft-word"
cask "tandem"                                                             # virtual office

# -----------------------------------------------------------------------------
# Casks — macOS enhancements
# -----------------------------------------------------------------------------
cask "alt-tab"                                                            # Windows-style alt-tab
cask "jordanbaird-ice"                                                    # menu bar manager
cask "copyq"                                                              # clipboard manager
cask "flux"                                                               # night shift / blue light
cask "couleurs"                                                           # color picker
cask "menumeters"                                                         # system monitor in menu bar
cask "cold-turkey-blocker"                                                # website/app blocker
cask "rescuetime"                                                         # time tracking

# -----------------------------------------------------------------------------
# Casks — Media
# -----------------------------------------------------------------------------
cask "vlc"
cask "gimp"
cask "capcut"                                                             # video editor
cask "qbittorrent"

# -----------------------------------------------------------------------------
# Casks — Gaming
# -----------------------------------------------------------------------------
cask "steam"
cask "nvidia-geforce-now"

# -----------------------------------------------------------------------------
# Casks — Cloud & storage
# -----------------------------------------------------------------------------
cask "google-drive"

# -----------------------------------------------------------------------------
# Casks — Video conferencing
# -----------------------------------------------------------------------------
cask "webex"

# -----------------------------------------------------------------------------
# Casks — AI
# -----------------------------------------------------------------------------
cask "claude"
cask "mindmac"                                                            # multi-model AI client
cask "superwhisper"                                                       # voice-to-text AI

# -----------------------------------------------------------------------------
# Casks — Other
# -----------------------------------------------------------------------------
cask "anki"                                                               # flashcards / spaced repetition
cask "balsamiq-wireframes"                                                # wireframing / mockups
cask "timing"                                                             # automatic time tracker

# -----------------------------------------------------------------------------
# Not available via Homebrew — install manually
# -----------------------------------------------------------------------------
# - Hotspot Shield   https://www.hotspotshield.com/
# - IceBar            (menu bar utility)
# - Joy              https://getjoy.app/
# - Pop              https://pop.com/
# - ScreenBrush      https://screenbrush.app/
